gamegrd/edgetx/radio/src/targets/stm32h747i-eval/system_init.cpp
#include <stdint.h>
#include "stm32_cmsis.h"
#include "system_clock.h"
#include "stm32h7xx_hal_cortex.h"

// Linker script symbols
extern uint32_t _start_isr_vector;
extern uint32_t _sidata;
extern uint32_t _sdata;
extern uint32_t _edata;
extern uint32_t _sbss;
extern uint32_t _ebss;
extern uint32_t _estack;
extern uint32_t SDRAM_START;

extern "C" void CPU_CACHE_Enable();
extern "C" void MPU_Init();
extern "C" void clean_dcache();

#if defined(SDRAM)
// SDRAM driver
extern "C" void SDRAM_Init();
#endif

extern "C" void __libc_init_array();
extern "C" int main();

extern "C" __attribute__((naked))
void Reset_Handler()
{
  asm inline (
    "ldr sp, =_estack \n"
  );
  
#if defined(BOOT)
  // MCU Init
  asm inline (
    "bl SystemInit \n"
    "bl SystemClock_Config \n"
#if defined(SDRAM)
    "bl SDRAM_Init \n"
#endif
    "bl MPU_Init \n"
    "bl CPU_CACHE_Enable \n"
  );
#else
  asm inline (
    "bl set_vtor \n"
  );
#endif

  // Copy initialized data segment
  // uint32_t* src = &_sidata;
  // for (uint32_t* dst = &_sdata; dst < &_edata;) {
  //   *(dst++) = *(src++);
  // }
  asm inline (
    "ldr r0, =_sdata    \n"
    "ldr r1, =_edata    \n"
    "ldr r2, =_sidata   \n"
    "movs r3, 0         \n"
    "b LoopCopyDataInit \n"

  "CopyDataInit:        \n"
    "ldr r4, [r2, r3]   \n"
    "str r4, [r0, r3]   \n"
    "adds r3, r3, #4    \n"

  "LoopCopyDataInit:    \n"
    "adds r4, r0, r3    \n"
    "cmp r4, r1         \n"
    "bcc CopyDataInit   \n"
  );
 
  // Zero fill bss segment
  // for (uint32_t* dst = &_sbss; dst < &_ebss;) {
  //   *(dst++) = 0;
  // }
  asm inline (
    "ldr r2, =_sbss    \n"
    "ldr r4, =_ebss    \n"
    "movs r3, 0        \n"
    "b LoopFillZerobss \n"

  "FillZerobss:        \n"
    "str  r3, [r2]     \n"
    "adds r2, r2, 4    \n"

  "LoopFillZerobss:    \n"
    "cmp r2, r4        \n"
    "bcc FillZerobss   \n"
  );

  asm inline (
    "bl clean_dcache \n"
    // Call static constructors
    "bl __libc_init_array \n"
    // Call the application's entry point
    "bl main \n"
    "bx lr   \n"
  );
}

extern "C" void set_vtor() {
  SCB->VTOR = (intptr_t)&_start_isr_vector;
}

extern "C" __attribute__((used))
void CPU_CACHE_Enable()
{
  /* Enable I-Cache */
  SCB_EnableICache();

  /* Enable D-Cache */
  SCB_EnableDCache();
}

extern "C" __attribute__((used))
void MPU_Init()
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /*
   * Region 0: overwrite default setting to prevent speculative
   *           read to unavailable memories.
   * Range: 0x60000000 to 0xE0000000
   *
   * Set as strongly ordered, code execution disabled
   */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

#if defined(FIRMWARE_QSPI)
  /* Region 2: QSPI memory range, bank1 */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.BaseAddress = 0x90000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_8MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);
#endif

#if defined(SDRAM)
  /* Region 3: SDRAM memory range */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER3;
  MPU_InitStruct.BaseAddress = (uint32_t)&SDRAM_START;
  MPU_InitStruct.Size = MPU_REGION_SIZE_8MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);
#endif

  /* Region 3: SRAM1 memory range */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER4;
  MPU_InitStruct.BaseAddress = 0x30000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_32KB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

  /* Enable bus fault exception */
  SCB->SHCSR |= SCB_SHCSR_BUSFAULTENA_Msk;
}

extern "C" void clean_dcache() {
  SCB_CleanDCache();
}
